"use strict"
/*
При розв’язанні задач намагайтесь використовувати відповідні методи (map, filter, reduce,…) всюди, де це можливо
Задача. Дано історію цін на цінні папери за деякий період (згенерувати від 1 до 10000)
	  1)Сформувати новий масив, у якому є тільки ті, що більші за 1000 грн.
	  2)Сформувати новий масив, у якому є номери тільки тих, що більші за 1000 грн.
	  3)Сформувати список з тих цін, які більші за попереднє значення
	  4)Сформувати новий масив, що міститиме значення цін у відсотках стосовно максимального
	  5)Підрахувати кількість змін цін
	  6)Визначити, чи є ціна, що менше 1000
	  7)Визначати, чи усі ціни більше за 1000
	  8)Підрахувати кількість цін, що більше за 1000
	  9)Підрахувати суму цін, що більше за 1000
	  10)Знайти першу ціну, що більше за 1000
	  11)Знайти індекс першої ціни, що більше за 1000
	  12)Знайти останню ціну, що більше за 1000
	  13)Знайти індекс останньої ціни, що більше за 1000

*/

